type middleName = {
    male: string[],
    female: string[]
}

const usa: middleName = {male:[], female:[]};
const russia: middleName = {
    male:["Иванович", "Александрович", "Сергеевич", "Андреевич", "Дмитриевич", "Николаевич", "Михайлович",
        "Владимирович", "Петрович", "Алексеевич", "Егорович", "Викторович", "Павлович", "Игоревич", "Ярославович",
        "Олегович", "Романович", "Васильевич", "Витальевич", "Георгиевич", "Валентинович", "Артемович", "Вячеславович",
        "Валерьевич", "Анатольевич"],
    female:["Семеновна", "Федоровна", "Морозовна", "Волковна", "Алексеевна", "Лебедевна", "Соколовна", "Степановна",
        "Николаевна", "Орловна", "Андреевна", "Макаровна", "Никитична", "Захаровна", "Григорьевна", "Борисовна",
        "Ильинична", "Максимовна", "Дмитриевна", "Тимофеевна", "Кузьминична", "Фомична",
        "Сергеевна", "Анатольевна", "Матвеевна"]
};
const japan: middleName = {male:[], female:[]};

const middleNames = {
    usa: usa,
    russia: russia,
    japan: japan
}

export default middleNames;
