const usa = {
        "California": ["Los Angeles", "San Francisco", "San Diego", "Sacramento", "San Jose", "Fresno", "Oakland", "Long Beach", "Santa Ana", "Anaheim"],
        "Texas": ["Houston", "Dallas", "Austin", "San Antonio", "Fort Worth", "El Paso", "Arlington", "Corpus Christi", "Plano", "Laredo"],
        "Florida": ["Miami", "Orlando", "Tampa", "Jacksonville", "Fort Lauderdale", "Saint Petersburg", "Tallahassee", "Hollywood", "Fort Myers", "Naples"],
        "New York": ["New York City", "Buffalo", "Rochester", "Syracuse", "Albany", "Yonkers", "Long Island", "White Plains", "New Rochelle", "Mount Vernon"],
        "Illinois": ["Chicago", "Aurora", "Rockford", "Joliet", "Naperville", "Springfield", "Peoria", "Elgin", "Waukegan", "Cicero"],
        "Pennsylvania": ["Philadelphia", "Pittsburgh", "Allentown", "Erie", "Reading", "Scranton", "Bethlehem", "Lancaster", "Harrisburg", "York"],
        "Ohio": ["Columbus", "Cleveland", "Cincinnati", "Toledo", "Akron", "Dayton", "Parma", "Youngstown", "Canton", "Lorain"],
        "Michigan": ["Detroit", "Grand Rapids", "Warren", "Sterling Heights", "Lansing", "Ann Arbor", "Flint", "Dearborn", "Livonia", "Troy"],
        "Georgia": ["Atlanta", "Augusta", "Columbus", "Macon", "Savannah", "Athens", "Sandy Springs", "Roswell", "Johns Creek", "Albany"],
        "North Carolina": ["Charlotte", "Raleigh", "Greensboro", "Durham", "Winston-Salem", "Fayetteville", "Cary", "Wilmington", "High Point", "Concord"],
        "New Jersey": ["Newark", "Jersey City", "Paterson", "Elizabeth", "Edison", "Trenton", "Clifton", "Camden", "Passaic", "Union City"],
        "Virginia": ["Virginia Beach", "Norfolk", "Chesapeake", "Richmond", "Newport News", "Alexandria", "Hampton", "Roanoke", "Portsmouth", "Suffolk"],
        "Washington": ["Seattle", "Spokane", "Tacoma", "Vancouver", "Bellevue", "Everett", "Kent", "Yakima", "Renton", "Spokane Valley"],
        "Massachusetts": ["Boston", "Worcester", "Springfield", "Lowell", "Cambridge", "Brockton", "New Bedford", "Quincy", "Lynn", "Fall River"],
        "Indiana": ["Indianapolis", "Fort Wayne", "Evansville", "South Bend", "Carmel", "Fishers", "Bloomington", "Hammond", "Gary", "Lafayette"]
};

const russia = {
    "Московская область": ["Москва", "Красногорск", "Подольск", "Коломна", "Дмитров", "Жуковский", "Сергиев Посад", "Серпухов", "Люберцы", "Одинцово"],
    "Ленинградская область": ["Санкт-Петербург", "Пушкин", "Кронштадт", "Выборг", "Ломоносов", "Петродворец", "Кировск", "Кингисепп", "Всеволожск", "Колпино"],
    "Тюменская область": ["Тюмень", "Тобольск", "Ишим", "Ялуторовск", "Заводоуковск", "Тарко-Сале", "Нижневартовск", "Ханты-Мансийск", "Новый Уренгой", "Сургут"],
    "Свердловская область": ["Екатеринбург", "Нижний Тагил", "Каменск-Уральский", "Первоуральск", "Магнитогорск", "Челябинск", "Новоуральск", "Асбест", "Качканар", "Камышлов"],
    "Челябинская область": ["Челябинск", "Магнитогорск", "Златоуст", "Копейск", "Миасс", "Троицк", "Чебаркуль", "Снежинск", "Верхнеуральск", "Кыштым"],
    "Нижегородская область": ["Нижний Новгород", "Дзержинск", "Арзамас", "Саров", "Бор", "Балахна", "Богородск", "Семенов", "Большое Козино", "Первомайск"],
    "Самарская область": ["Самара", "Тольятти", "Сызрань", "Новокуйбышевск", "Чапаевск", "Жигулёвск", "Отрадный", "Похвистнево", "Кинель", "Нефтегорск"],
    "Краснодарский край": ["Краснодар", "Сочи", "Новороссийск", "Ейск", "Армавир", "Тимашевск", "Геленджик", "Крымск", "Кропоткин", "Туапсе"],
    "Ростовская область": ["Ростов-на-Дону", "Таганрог", "Шахты", "Новочеркасск", "Волгодонск", "Азов", "Батайск", "Сальск", "Каменск-Шахтинский", "Пролетарск"],
    "Архангельская область": ["Архангельск", "Северодвинск", "Котлас", "Мирный", "Новодвинск", "Соловецк", "Устьян", "Каргополь", "Шенкурск", "Лешуконское"],
    "Воронежская область": ["Воронеж", "Лиски", "Борисоглебск", "Россошь", "Нововоронеж", "Кашира", "Павловск", "Острогожск", "Бобров", "Анна"],
    "Белгородская область": ["Белгород", "Старый Оскол", "Губкин", "Шебекино", "Новый Оскол", "Короча", "Алексеевка", "Бирюч", "Строитель", "Грайворон"],
    "Волгоградская область": ["Волгоград", "Волжский", "Камышин", "Михайловка", "Калач-на-Дону", "Фролово", "Урюпинск", "Котельниково", "Дубовка", "Петров Вал"],
    "Новосибирская область": ["Новосибирск", "Бердск", "Искитим", "Куйбышев", "Мошково", "Коченёво", "Татарск", "Черепаново", "Карасук", "Барабинск"],
    "Омская область": ["Омск", "Тара", "Исилькуль", "Калачинск", "Колосовка", "Марьяновка", "Муромцево", "Называевск", "Нижняя Омка", "Одесское"]
};

const japan = {
        "北海道": ["札幌市", "旭川市", "函館市", "北見市", "苫小牧市", "帯広市", "網走市", "留萌市", "岩見沢市", "夕張市"],
        "青森県": ["青森市", "八戸市", "弘前市", "五所川原市", "田子町", "三沢市", "新青森市", "むつ市", "津軽", "五所川原市"],
        "岩手県": ["盛岡市", "花巻市", "滝沢市", "二戸市", "北上市", "花巻市", "一関市", "奥州市", "女川町", "八幡平市"],
        "宮城県": ["仙台市", "塩竈市", "古川市", "白石市", "石巻市", "気仙沼市", "東松島市", "利府町", "古川市", "女川町"],
        "秋田県": ["山形市", "天童市", "酒田市", "新庄市", "南山", "新庄市", "大仙市", "鹿角市", "十和田市", "三種町"],
        "山形県": ["つる", "天内", "庄内", "東みやぎ", "佐賀", "村上市", "酒田市", "東置賜郡", "中つかさ", "南つかさ"],
        "福島県": ["福島市", "郡山市", "会津若松市", "須賀川市", "喜多方市", "相馬市", "須賀川市", "いわき市", "相馬市", "白河市"],
        "茨城県": ["水戸市", "つくば市", "取手市", "ひたちなか市", "茨城市", "ひたち", "大洗", "多賀", "潮来", "ひたち"],
        "栃木県": ["うつのみや", "前橋市", "大子", "玉里", "市貝", "佐野", "栃木", "田原", "宇都宮市", "佐野"],
        "群馬県": ["前橋市", "高崎市", "太田市", "桐生市", "伊勢崎市", "藤岡市", "高崎市", "玉村", "田村", "深谷市"],
        "埼玉県": ["さいたま市", "川口市", "所沢市", "越谷市", "越生町", "熊谷市", "東松山市", "川越市", "羽生市", "秩父市"],
        "千葉県": ["千葉市", "習志野市", "船橋市", "平戸市", "茨城", "久喜市", "船橋市", "松戸市", "船橋市", "八千代"],
        "東京都": ["東京", "渋谷", "新宿", "原宿", "池袋", "目黒", "六本木", "秋葉原", "丸の内", "横浜市"],
        "神奈川県": ["横浜市", "川崎市", "山手", "平塚市", "鎌倉市", "湘南", "横浜市", "秦野", "綾瀬", "鎌倉市"],
        "長野県": ["長野市", "諏訪市", "飯田市", "松本市", "茨城", "須坂市", "上田市", "富山市", "鶯", "富山市"]
};

export {
    usa,
    russia,
    japan
}
