type surname = {
    male: string[],
    female: string[]
}

const _usa: string[] = ["Smith", "Johnson", "Williams", "Jones", "Brown", "Davis", "Miller", "Wilson", "Moore", "Taylor",
    "Anderson", "Thomas", "Jackson", "White", "Harris", "Martin", "Thompson", "Garcia", "Martinez", "Robinson",
    "Clark", "Rodriguez", "Lewis", "Lee", "Walker", "Hall", "Allen", "Young", "Hernandez", "King", "Wright", "Lopez",
    "Hill", "Scott", "Green", "Adams", "Baker", "Gonzalez", "Nelson", "Carter", "Mitchell", "Perez", "Roberts", "Turner",
    "Phillips", "Campbell", "Parker", "Evans", "Edwards", "Collins", "Stewart", "Sanchez", "Morris", "Rogers", "Reed",
    "Cook", "Morgan", "Bell", "Murphy", "Bailey", "Rivera", "Cooper", "Richardson", "Cox", "Howard", "Ward", "Torres",
    "Peterson", "Gray", "Ramirez", "James", "Watson", "Brooks", "Kelly", "Sanders", "Price", "Bennett", "Wood", "Barnes",
    "Ross", "Henderson", "Coleman", "Jenkins", "Perry", "Powell", "Long", "Patterson", "Hughes", "Flores", "Washington",
    "Butler", "Simmons"];
const _japan: string[] = ["佐藤", "鈴木", "高橋", "田中", "伊藤", "渡辺", "山本", "中村", "小林", "加藤", "吉田", "山田", "佐々木",
    "山口", "松本", "井上", "木村", "清水", "斎藤", "高木", "山崎", "中島", "森", "小川", "藤井", "岡田", "後藤", "長谷川", "石川",
    "前田", "小野", "武田", "森田", "原田", "柴田", "酒井", "岡本", "秋山", "西村", "宮崎", "古川", "福田", "三浦", "藤田", "岩崎",
    "佐野", "村上", "遠藤", "小島", "高田", "荒木", "大野", "水野", "小松", "白石", "吉川", "矢野", "菅原", "藤本", "小山", "土屋",
    "武藤", "上田", "河野", "杉山", "近藤", "久保", "遠山", "藤岡", "斉藤", "村田", "大塚", "千葉", "岡崎", "松田", "菊地", "中川",
    "森下", "坂本", "工藤", "平野", "西田", "丸山", "松井", "浜田", "菅野", "五十嵐", "加藤", "野村", "戸田", "横山", "内田", "小池", "片岡"];
const russia: surname = {
    male: ["Петров", "Иванов", "Смирнов", "Кузнецов", "Васильев", "Михайлов", "Новиков", "Федоров", "Морозов",
        "Соколов", "Попов", "Лебедев", "Алексеев", "Семенов", "Егоров", "Павлов", "Козлов", "Степанов", "Николаев",
        "Орлов", "Андреев", "Макаров", "Никитин", "Захаров"],
    female: ["Иванова", "Смирнова", "Кузнецова", "Попова", "Соколова", "Лебедева", "Козлова", "Новикова", "Морозова",
        "Петрова", "Волкова", "Соловьева", "Васильева", "Зайцева", "Павлова", "Семенова", "Голубева", "Виноградова",
        "Богданова", "Воробьева", "Федорова", "Михайлова", "Беляева", "Тарасова", "Белова", "Комарова", "Орлова",
        "Киселева", "Макарова", "Андреева", "Ковалева", "Ильина", "Гусева", "Титова", "Кузьмина", "Кудрявцева",
        "Баранова", "Куликова", "Алексеева", "Степанова", "Яковлева", "Сорокина", "Сергеева", "Романова", "Захарова",
        "Борисова", "Королева", "Герасимова", "Пономарева", "Григорьева", "Лазарева", "Медведева", "Жукова", "Савельева",
        "Тимофеева", "Фомина", "Чернова", "Абрамова", "Мартынова", "Ефимова", "Федотова", "Щербакова", "Назарова",
        "Калинина", "Барсукова", "Степанова", "Архипова", "Голованова", "Горшкова", "Игнатьева", "Лаврова", "Бирюкова",
        "Кондратьева", "Суханова", "Афанасьева", "Мельникова", "Чернышева", "Зиновьева", "Климова", "Лукьянова", "Малахова",
        "ШубинаЯковлева", "Макарова", "Щербакова", "Михеева", "Филиппова", "Зимина", "Миронова", "Авдеева", "Колесникова",
        "Максимова", "Сидорова", "Полякова", "Лазарева", "ИльинаПавлова", "Самсонова", "Крюкова", "Соболева", "Леонова",
        "Крылова", "Гордеева", "Корнеева", "Климова", "Трофимова", "Сотникова", "Дементьева", "Родионова", "Денисова",
        "Гаврилова", "Маслова", "Ширяева", "Филатова", "Маркова", "Белоусова", "Суворова", "Тихонова", "Анисимова",
        "Еремеева", "Терентьева", "Мартынова", "Белозерова", "Нестерова", "Федосеева", "Устинова", "Тимофеева", "Галкина"]
};

const japan: surname = {
    male: _japan,
    female: _japan
}
const usa: surname = {
    male: _usa,
    female: _usa
}

const surnames = {
    usa: usa,
    russia: russia,
    japan: japan
}

export default surnames;